In [1]:
# Date: 6-Oct-2019

import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4), index=['Row1','Row2','Row3','Row4','Row5'], 
                columns=['Col1','Col2','Col3','Col4'], dtype='int')

df.head(5)

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [3]:
df.loc['Row1']

Col1    0
Col2    1
Col3    2
Col4    3
Name: Row1, dtype: int32

In [4]:
df.iloc[:,:]

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [5]:
df.iloc[0:3,:]

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11

In [6]:
df.iloc[1:3,0:-2]

      Col1  Col2
Row2     4     5
Row3     8     9

In [7]:
print(type(df.iloc[1:3,-2:]))

df.iloc[1:3,-2:]

<class 'pandas.core.frame.DataFrame'>

      Col3  Col4
Row2     6     7
Row3    10    11

In [8]:
print(type(df.iloc[1:3,-2]))

df.iloc[1:3,-2]

<class 'pandas.core.series.Series'>

Row2     6
Row3    10
Name: Col3, dtype: int32

In [9]:
print(type(df.iloc[1,2]))

df.iloc[1,2]

<class 'numpy.int32'>

6

In [10]:
# Convert Dataframe into array

df.iloc[0:2,0:2].values

array([[0, 1],
       [4, 5]])

In [11]:
# Check Null values

df.isnull().sum()

Col1    0
Col2    0
Col3    0
Col4    0
dtype: int64

In [12]:
# Check different categories

df['Col1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: Col1, dtype: int64

In [13]:
df['Col1'].unique()

array([ 0,  4,  8, 12, 16], dtype=int64)

In [14]:
########################  StringIO ############ ############ ############ ############ 

from io import StringIO

data='Col1,Col2,Col3\na0,b0,c0\na1,b1,c1\na2,b2,c2'

# Demo for Different options in read_csv
test_df=pd.read_csv(StringIO(data),usecols=lambda x: x.upper() in ['COL1','COL2'],dtype={'Col1':str,'Col2':np.str})

test_df

  Col1 Col2
0   a0   b0
1   a1   b1
2   a2   b2

In [15]:
test_df.dtypes

Col1    object
Col2    object
dtype: object

In [16]:
data='Col1,Col2,Col3\n1,b0,c0\n2,b1,c1\n3,b2,c2'

test_df=pd.read_csv(StringIO(data),index_col=0)

test_df

     Col2 Col3
Col1
1      b0   c0
2      b1   c1
3      b2   c2

In [17]:
data='Col1,Col2\n"Hi \\, \\my Name\\ is Pramod",5'
test_df=pd.read_csv(StringIO(data),escapechar='\\')
test_df

                     Col1  Col2
0  Hi , my Name is Pramod     5

In [18]:
df=pd.read_csv('https://www.stats.govt.nz/assets/Uploads/Business-price-indexes/Business-price-indexes-June-2019-quarter/Download-data/business-price-indexes-june-2019-quarter-csv.csv')

#df.to_csv('save.csv')

## Read Json file

In [19]:
data = '{"columns":["col 1","col 2"],  "index":["row 1","row 2"],  "data":[["a","b"],["c","d"]]}'

data = '{"Name":["Pramod","Chandan","Priyanka"],"Age":["32","28","30"]}'

df1=pd.read_json(data)
df1

       Name  Age
0    Pramod   32
1   Chandan   28
2  Priyanka   30

In [20]:
df1.to_json()

'{"Name":{"0":"Pramod","1":"Chandan","2":"Priyanka"},"Age":{"0":32,"1":28,"2":30}}'

In [21]:
df1.to_json(orient="records")

'[{"Name":"Pramod","Age":32},{"Name":"Chandan","Age":28},{"Name":"Priyanka","Age":30}]'

In [22]:
df1.to_pickle('abc.pkl')

In [23]:
df3=pd.read_pickle('abc.pkl')
df3

       Name  Age
0    Pramod   32
1   Chandan   28
2  Priyanka   30